Revit 2024 API
Definition.ParameterGroup Property
 Returns the group ID of the parameter definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")]
public abstract BuiltInParameterGroup ParameterGroup { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")> _
Public MustOverride ReadOnly Property ParameterGroup As BuiltInParameterGroup
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")]
public:
virtual property BuiltInParameterGroup ParameterGroup {
	BuiltInParameterGroup get () abstract;
}
See Also
Definition Class
Autodesk.Revit.DB Namespace